user_name = input('Введите имя:')
num_group = int(input('Введите номер группы:'))
teacher_name = input('Введите имя преподавателя:')

print(f' \tМеня зовут {user_name}. Я прохожу обучение в группе Python {num_group}.\n Недавно мы закончили блок с Front-end.\n Было интересно немного заглянуть в эту "приоткрывшуюся дверь".\n Нам предстоит еще много изучать и практиковаться.\n Но думаю, что мы сможем стать хорошими специалистами.\n\n \tПреподаватель {teacher_name} отлично проводит лекции.\n Лекция делится на устную часть и практическую.\n После есть возможность задать вопросы.\n Ответы мы получаем быстро и четко, если что-то вызывает затруднения {teacher_name} всегда поможет.')
